In [ ]:
Groupby Function :- Group by with get_group 
Loc 
insert  == df.insert(location of index , column name,values)
rename ==

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A': [10,20,30,40,50], 'B':[1,2,3,4,5]})
df

    A  B
0  10  1
1  20  2
2  30  3
3  40  4
4  50  5

## Apply()

 syntax= df.apply(function_name)

def name_of _function(parameter):
    block of code
    return

In [3]:
def Multiplication(a):
    a=a*10
    return a

In [4]:
 Multiplication(10)

100

In [5]:
def addition(a):
    a = a+100
    return a

In [6]:
addition(20)

120

In [7]:
df

    A  B
0  10  1
1  20  2
2  30  3
3  40  4
4  50  5

In [8]:
df.apply(addition)  # 1   a = a+100  1+100 ==  101

     A    B
0  110  101
1  120  102
2  130  103
3  140  104
4  150  105

In [9]:
df

    A  B
0  10  1
1  20  2
2  30  3
3  40  4
4  50  5

In [10]:
df.apply( Multiplication)

     A   B
0  100  10
1  200  20
2  300  30
3  400  40
4  500  50

In [11]:
df['C'] = df['A'].apply(addition)  # A =[10,20,30,40,50].a=a+100 
df

    A  B    C
0  10  1  110
1  20  2  120
2  30  3  130
3  40  4  140
4  50  5  150

In [12]:
df['C'] = df['B'].apply(addition)
df

    A  B    C
0  10  1  101
1  20  2  102
2  30  3  103
3  40  4  104
4  50  5  105

In [ ]:
# lambda x : x*10  == (10,1,101)  == 10*10,1*10,101*10  == 100,10,1010

In [13]:
df.apply(lambda x:x*10)

     A   B     C
0  100  10  1010
1  200  20  1020
2  300  30  1030
3  400  40  1040
4  500  50  1050

In [14]:
df1 = pd.DataFrame({'City': ['Pune', 'Banglore','Mumbai','Delhi']})
df1

       City
0      Pune
1  Banglore
2    Mumbai
3     Delhi

In [17]:
df1['City']=apply(lambda x:x.upper())
df1

NameError: name 'apply' is not defined

In [16]:
df1['City']= df1['City'].apply(lambda x:x.upper())
df1

       City
0      PUNE
1  BANGLORE
2    MUMBAI
3     DELHI

In [19]:
def case(a):
    return a.upper()

In [20]:
df1['City'] = df1['City'].apply(case)
df1

       City
0      PUNE
1  BANGLORE
2    MUMBAI
3     DELHI

data frame 

Emp_id     emp_name    address    Salary    
   101      sarika       pune      70000           
    
     
        
Write down a function for 10% salary increment 
    10% increment_function   
    7000
    
apply this function on your dataframe salary feature and create a new feature salary_increment

In [21]:
student = pd.DataFrame({'Emp_id':[101,102,103,104,105],'emp_name':["Mario","Marii","Pratik","Maaru","Aman"],'address':['pune','pune','pune','pune','pune'],'salary':[7000,8000,9000,10000,11000]})
student

   Emp_id emp_name address  salary
0     101    Mario    pune    7000
1     102    Marii    pune    8000
2     103   Pratik    pune    9000
3     104    Maaru    pune   10000
4     105     Aman    pune   11000

In [22]:
def increament_function(a):
    a = (a*10)/100
    return a

In [23]:
student['increament_salary'] = student['salary'].apply(increament_function)
student

   Emp_id emp_name address  salary  increament_salary
0     101    Mario    pune    7000              700.0
1     102    Marii    pune    8000              800.0
2     103   Pratik    pune    9000              900.0
3     104    Maaru    pune   10000             1000.0
4     105     Aman    pune   11000             1100.0

In [ ]:
write down a function to add as a incremented salary 

salary+increament_salary  == incremneted salary

In [25]:
student1 = pd.DataFrame({'Emp_id':[101,102,103,104,105],'emp_name':["Mario","Marii","Pratik","Maaru","Aman"],'address':['pune','pune','pune','pune','pune'],'salary':[7000,8000,9000,10000,11000]})
student1

   Emp_id emp_name address  salary
0     101    Mario    pune    7000
1     102    Marii    pune    8000
2     103   Pratik    pune    9000
3     104    Maaru    pune   10000
4     105     Aman    pune   11000

In [27]:
student['increament_salary'] = student['salary'].apply(increament_function)
student

   Emp_id emp_name address  salary  increament_salary
0     101    Mario    pune    7000              700.0
1     102    Marii    pune    8000              800.0
2     103   Pratik    pune    9000              900.0
3     104    Maaru    pune   10000             1000.0
4     105     Aman    pune   11000             1100.0

In [28]:
student['added_sal'] = student['salary'] + student[ 'increament_salary']
student

   Emp_id emp_name address  salary  increament_salary  added_sal
0     101    Mario    pune    7000              700.0     7700.0
1     102    Marii    pune    8000              800.0     8800.0
2     103   Pratik    pune    9000              900.0     9900.0
3     104    Maaru    pune   10000             1000.0    11000.0
4     105     Aman    pune   11000             1100.0    12100.0

In [26]:
def incremented_salary(a):
    b =+ (a*10)/100
    return a+b

In [ ]:
Create a data frame 

srno  Student_name   Cgpa     
  1      Jon         7 
  2      Ruby        "Please do hard work"

new_column

below 5 cgpa write down a message "please do hard work "

In [ ]:
def check_cgpa(a):
    if a < 5:
        return "Plz do the Hard Work"
    else:
        return "Keep it up"